package by.htp.branchings.logic;

public class Task1 {
public static void task() {
	/*  Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – 
	    вывести на экран цифру 7, в противном случае – цифру 8. */
	int a,b;
	
	a = 34;
	b = 58;
	
	if (a < b) System.out.println (7);
	
	else System.out.println (8);
	
	
}
}
