package by.htp.branchings.logic;

public class Task24 {
public static void task() {
	/* Составить программу, определяющую результат гадания на ромашке — 
	 * «любит—не любит», взяв за исходное данное количество лепестков n.
	 */
	
	int  x, n;
	
	  //n = 6; 
	  
      x = 3;

	
	switch (x) {
		case 1:
			System.out.println("любит");
			break;
		case 2:
			System.out.println("не любит");
			break;
		case 3:
			System.out.println("любит");
			break;	
		case 4:
			System.out.println("не любит");
			break;
		case 5:
			System.out.println("не любит");
			break;
				
		case 6:
			System.out.println("любит");
			break;
}
}
}