package by.htp.branchings.logic;

public class Task25 {
public static void task() {
	/*Написать программу — модель анализа пожарного датчика в помещении,
	 *  которая выводит сообщение «Пожароопасная ситуация », если температура 
	 *  в комнате превысила 60° С.
	 */
	int c;
	
	c = 61;
	
	if(c>60) System.out.print("Пожароопасная ситуация");
}
}
