package by.htp.branchings.logic;

public class Task2 {
 public static void task() {
	 /*  Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 –
	    вывести на экран слово «yes», в противном случае – слово «no»
      */
	 
	 int a, b;
	 a = 34;
	 b = 24;
	 
	 if (a<b) System.out.println("yes");
	 else System.out.println("no");
 }
}
