package by.htp.branchings.logic;

public class Task3 {
public static void task () {
	/*Составить программу сравнения введенного числа а и цифры 3. 
	 * Вывести на экран слово «yes», если число а меньше 3; если 
	 * больше, то вывести слово «no».
	 */
	int a = 4;
	
	if (a>3 ) System.out.print("yes");
	else System.out.print("no");
}
}
